-- phpMyAdmin SQL Dump
-- version 4.0.4.1
-- http://www.phpmyadmin.net
--
-- 主机: 127.0.0.1
-- 生成日期: 2015 �?12 �?18 �?11:55
-- 服务器版本: 5.6.11
-- PHP 版本: 5.5.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `bdnews`
--
CREATE DATABASE IF NOT EXISTS `bdnews` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `bdnews`;

-- --------------------------------------------------------

--
-- 表的结构 `bd_label`
--

CREATE TABLE IF NOT EXISTS `bd_label` (
  `id` tinyint(4) NOT NULL DEFAULT '0',
  `news_label_name` varchar(50) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `bd_label`
--

INSERT INTO `bd_label` (`id`, `news_label_name`) VALUES
(1, '置顶'),
(2, '百家原创'),
(3, '为你优选'),
(4, '腾讯要闻'),
(5, '新浪要闻'),
(6, '凤凰要闻');

-- --------------------------------------------------------

--
-- 表的结构 `bd_list`
--

CREATE TABLE IF NOT EXISTS `bd_list` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `news_title` varchar(50) DEFAULT NULL,
  `news_content` varchar(200) DEFAULT NULL,
  `news_img` varchar(100) DEFAULT NULL,
  `news_time` varchar(20) DEFAULT NULL,
  `news_label_id` tinyint(4) DEFAULT NULL,
  `news_type_id` tinyint(4) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=92 ;

--
-- 转存表中的数据 `bd_list`
--

INSERT INTO `bd_list` (`id`, `news_title`, `news_content`, `news_img`, `news_time`, `news_label_id`, `news_type_id`) VALUES
(64, '富士山下', '拦路雨偏似雪花 饮泣的你冻吗\r\n这风褛我给你磨到有襟花\r\n连掉了渍也不怕 怎么始终牵挂\r\n苦心选中今天想车你回家\r\n \r\n原谅我不再送花 伤口应要结疤\r\n花瓣铺满心里坟场才害怕\r\n如若你非我不嫁 彼此终必火化\r\n一生一世等一天需要代价\r\n \r\n谁都只得那双手 靠拥抱亦难任你拥有\r\n要拥有必先懂失去怎接受\r\n曾沿着雪路浪游 为何为好事泪流\r\n谁能凭爱意要富士山私有\r\n \r\n何不把悲哀感觉 假设是来自', '2015-12-18 1450404744.jpeg', '1450404744070', 1, 1),
(65, '爱的太迟', '我过去那死党早晚共对各也扎职以后没法畅聚\r\n而终於相约到但无言共对疏淡如水\r\n日夜做见爸爸刚好想呻却霎眼看出他多了皱纹\r\n而他的苍老感是从来未觉太内疚担心\r\n最心痛是爱得太迟有些心意不可等某个日子\r\n盲目地发奋忙忙忙其实自私梦中也习惯有压力要我得知\r\n最可怕是爱需要及时只差一秒心声都已变历史\r\n忙极极放肆见我爱的见相知要抱要吻怎麽也好\r\n偏要推说要等一下次\r\n我也觉我体质仿似下降看了正得到是别要太', '2015-12-18 1450432222.jpeg', '1450432222734', 1, 1),
(66, '爱太迟', '其实自己一\r\n　　个更开心\r\n　　只等你讲\r\n　　其实大家早已嫌大家却扮忙\r\n　　恨有多一点碰撞\r\n　　仍然无聊事干不敢打搅对方\r\n　　要是你愿意诚实讲一趟\r\n　　彼此都起码觉得释放\r\n　　不要哭我也忍得了这些年来的委曲\r\n　　没法真心爱下去只好真心真意的结束\r\n　　别再做情人做只猫做只狗不做情人\r\n　　做只宠物至少可爱迷人\r\n　　和你不瞅不睬最终只会成为敌人\r\n　　沦为旧朋友是否又称心\r\n　　没', '2015-12-18 1450432372.jpeg', '1450432372896', 1, 1),
(67, '白头吟', '皑如山上雪皎若云间月\r\n闻君有两意故来相决绝\r\n今日斗酒会明日沟水头\r\n躞蹀御沟上沟水东西流\r\n凄凄复凄凄嫁娶不须啼\r\n愿得一心人白头不相离\r\n竹竿何袅袅鱼尾何簁簁\r\n男儿重意气何用钱刀为\r\n凄凄复凄凄嫁娶不须啼\r\n愿得一心人白头不相离\r\n凄凄复凄凄嫁娶不须啼\r\n愿得一心人白头不相离', '2015-12-18 1450432483.jpeg', '1450432483054', 1, 1),
(68, '化身鼓捣的鲸', '我是只化身孤岛的蓝鲸\r\n有着最巨大的身影\r\n鱼虾在身侧穿行\r\n也有飞鸟在背上停\r\n\r\n我路过太多太美的奇景\r\n如同伊甸般的仙境\r\n而大海太平太静\r\n多少故事无人倾听\r\n\r\n我爱地中海的天晴\r\n爱西伯利亚的雪景\r\n爱万丈高空的鹰\r\n爱肚皮下的藻荇\r\n我在尽心尽力地多情\r\n直到那一天\r\n\r\nOS：“那一天，你来了”\r\n\r\n你的衣衫破旧\r\n而歌声却温柔\r\n陪我漫无目的四处漂流\r\n我的背脊如荒丘\r\n而你却', '2015-12-18 1450432613.jpeg', '1450432613076', 1, 1),
(69, '会痛的石头', '我是只化身孤岛的蓝鲸\r\n有着最巨大的身影\r\n鱼虾在身侧穿行\r\n也有飞鸟在背上停\r\n\r\n我路过太多太美的奇景\r\n如同伊甸般的仙境\r\n而大海太平太静\r\n多少故事无人倾听\r\n\r\n我爱地中海的天晴\r\n爱西伯利亚的雪景\r\n爱万丈高空的鹰\r\n爱肚皮下的藻荇\r\n我在尽心尽力地多情\r\n直到那一天\r\n\r\nOS：“那一天，你来了”\r\n\r\n你的衣衫破旧\r\n而歌声却温柔\r\n陪我漫无目的四处漂流\r\n我的背脊如荒丘\r\n而你却', '2015-12-18 1450432708.jpeg', '1450432708096', 1, 2),
(70, '今夜二十岁', '有些疑问只能留在二十岁\r\n就好像当初\r\n为何说再会\r\n不管缺什么\r\n只知道不要什么\r\n可爱和恨又如此绝对\r\n有些疯狂只能属于二十岁\r\n还不曾拥有\r\n就能不断给\r\n遗憾只因为\r\n错过了错的机会\r\n宁可做得不对\r\n也不后悔\r\n永远羡慕那时候的泪水\r\n受了伤而不识愁的滋味\r\n什么都很珍贵\r\n什么都敢浪费\r\n不留一点伤疤就不够完美\r\n永远记得那时候的汗水\r\n一场误会接着一个约会\r\n还学着别人说\r\n今夜不醉', '2015-12-18 1450432791.jpeg', '1450432791403', 1, 2),
(72, '可惜没如果', '假如把犯得起的错\r\n\r\n能错的都错过，应该还来得及去悔过\r\n\r\n假如没把一切说破\r\n\r\n那一场小风波，将一笑带过\r\n\r\n在感情面前，讲什么自我\r\n\r\n要得过且过，才好过\r\n\r\n全都怪我\r\n\r\n不该沉默时沉默，该勇敢时软弱\r\n\r\n如果不是我 误会自己洒脱\r\n\r\n让我们难过\r\n\r\n可当初的你，和现在的我，假如重来过\r\n\r\n倘若那天\r\n\r\n把该说的话好好说，该体谅的不执著\r\n\r\n如果那天我 不受情绪挑拨', '2015-12-18 1450433014.jpeg', '1450433014441', 1, 2),
(73, '煎熬', '早知道 你只是飞鸟 \r\n拥抱后 手中只剩下 羽毛 \r\n当初你又何必浪费 \r\n那么多咖啡和玫瑰 来打扰 \r\n\r\n我想要 安静地思考 \r\n天平上 让爱恨不再 动摇 \r\n一想你就平衡不了 \r\n我关灯还是关不掉 这风暴 \r\n\r\n心一跳 爱就开始煎熬 \r\n每一分 每一秒 \r\n火在烧 烧成灰有多好 \r\n叫思念 不要吵 \r\n我相信我已经快要 \r\n快要把你忘掉 \r\n跟寂寞 再和好 \r\n\r\n得不到 也不要乞讨 \r\n', '2015-12-18 1450433724.jpeg', '1450433724917', 1, 2),
(74, '风筝误', '梨花树下卷丝轮 随风纷纷\r\n谁裁木鹊一缕魂 落别村 \r\n风影无心惊扰了 对棋人\r\n幔里和诗  怕春雨成盆\r\n\r\n玉指揽风风不住  茜纱窗昏\r\n舟上摇波波不停  渡影重温\r\n错认庭前过马人  醉几分\r\n一抹笙香  吹梦成真\r\n\r\n风筝误  误了梨花花又开\r\n风筝误  捂了金钗雪里埋  \r\n风筝误  悟满相思挂苍苔  \r\n听雨声  数几声 风会来    \r\n\r\n上元溪旁点烛荷 千盏承诺\r\n怎捱雾锁红尘', '2015-12-18 1450433876.jpeg', '1450433876424', 1, 2),
(75, '飘渺醉', '君不见 谁在问 驮经白马自西来\r\n黄衣啊 少年人 已不在\r\n君不见 谁在问 一窗青山一窗年\r\n数排雁 已是人间四季天\r\n饮一钵不凋谢的风雪\r\n沙淹没来时路的寒夜\r\n尺素间 楮松烟 陈墨点点 落心弦\r\n游龙舞 惹谁醉了几千年\r\n引阑珊 衣不沾 薄指芊芊人缱倦\r\n旧时月光盛满了书简\r\n君不见 谁在问 一窗青山一窗年\r\n数排雁 已是人间四季天\r\n饮一钵不凋谢的风雪\r\n沙淹没来时路的寒夜\r\n尺素间 楮松烟', '2015-12-18 1450434109.jpeg', '1450434109326', 1, 3),
(76, '半壶砂', '墨已入水 渡一池青花\r\n揽五分红霞 采竹回家\r\n悠悠风来 埋一地桑麻\r\n一身袈裟 把相思放下\r\n\r\n十里桃花 待嫁的年华\r\n凤冠的珍珠 挽进头发\r\n檀香拂过 玉镯弄轻纱\r\n空留一盏 芽色的清茶\r\n\r\n倘若我心中的山水 你眼中都看到\r\n我便一步一莲花祈祷\r\n怎知那浮生一片草 岁月催人老\r\n风月花鸟 一笑尘缘了\r\n\r\n十里桃花 待嫁的年华\r\n凤冠的珍珠 挽进头发\r\n檀香拂过 玉镯弄轻纱\r\n空留一盏 芽', '2015-12-18 1450434244.jpeg', '1450434244690', 1, 3),
(77, '月满弦', '古塔旁 拾一地金黄\r\n雁扫落 满腹旧霜\r\n斑驳的木窗 等候月光\r\n是谁路过 诵一首情长\r\n看斜阳 吹红了菱墙\r\n茶汤 泛起过往\r\n点一支老香 泪湿衣裳\r\n是谁听见 说一句原谅\r\n风来 帆已过千里外\r\n风去 留一船霜白\r\n暮雨徘徊 谁梦中空折柴\r\n只怕夜冷故人来\r\n\r\n看斜阳 吹红了菱墙\r\n茶汤 泛起过往\r\n点一支老香 泪湿衣裳\r\n是谁听见 说一句原谅\r\n风来 帆已过千里外\r\n风去 留一船霜白\r\n暮', '2015-12-18 1450434374.jpeg', '1450434374234', 1, 3),
(78, '芙蓉雨', '藕花香 染檐牙\r\n惹那诗人纵步随她\r\n佩声微 琴声儿退\r\n斗胆了一池眉叶丹砂\r\n画船开 心随他\r\n谁不作美偏起风沙\r\n倚蓬窗 月色轻晃\r\n偶闻得渔翁一席话\r\n（试问） 多一份情又怎地\r\n站在别人的雨季\r\n淋湿自己空弹一出戏\r\n空望他 功成名就又怎地\r\n豆腐换成金羽衣 岂不知你已在画里\r\n\r\n画船开 心随他\r\n谁不作美偏起风沙\r\n倚蓬窗 月色轻晃\r\n偶闻得渔翁一席话\r\n（试问） 多一份情又怎地\r\n站', '2015-12-18 1450434459.jpeg', '1450434459028', 1, 3),
(81, '忘尘谷', '山外山 天外天\r\n追风逐月一瞬间\r\n日月定 金光莲\r\n鸟儿叫声祥和慈云现\r\n一路雨水 一路花又开\r\n雨后笑对 花谢被掩埋\r\n一路朝拜 一路的山脉\r\n咦呀咦耶 我是彩色艳阳的尘埃\r\n撑船人点着他的灯笼 江面竹排被映红\r\n吹笛人吹着他的幽梦 一声闻来万事离心中\r\n撑船人点着他的灯笼 江面竹排被映红\r\n吹笛人吹着他的幽梦 一声闻来万事离心中\r\n一色一物一夜已成空\r\n山外山 天外天\r\n追风逐月一瞬间\r\n日', '2015-12-18 1450434612.jpeg', '1450434612228', 1, 3),
(82, '一袖云', '谁家炉火热 茶烟起千朵\r\n百草香不过 采药的竹簸\r\n箫翁吹松珀 山阶往如梭\r\n水从寺门过 踏起层层波\r\n唔唔呃……\r\n在山顶揣一袖云 送给彼岸边的你\r\n迟迟你不来 风起 吹走山雨\r\n在山顶揣一袖云 送给路上的自己\r\n山外山上云外云 谁在那里 遥望知己\r\n谁家炉火热 茶烟起千朵\r\n百草香不过 采药的竹簸\r\n远山又着墨 树影空交错\r\n云从掌畔过 送与谁人拓\r\n在山顶揣一袖云 送给彼岸边的你\r\n迟迟你不', '2015-12-18 1450434721.jpeg', '1450434721694', 1, 4),
(83, '泼茶香', '风吹来 赏落红 渐浓\r\n月光下 放海灯 如童\r\n桨声里 纸帐中 唱着\r\n雪纷纷了红斗篷\r\n风又吹 羽叶花 牵藤\r\n半月光 点燃了 书灯\r\n曲栏外 回荡着 竹声\r\n谁能绕过这微微的冷\r\n飘带引斜阳 扫墨腕底香\r\n共我泼茶人 如今在哪方\r\n石绿补天长 云锣声两行\r\n微笑过往 只道是平常\r\n悠然一曲又闻泼茶香', '2015-12-18 1450435123.jpeg', '1450435123339', 1, 4),
(84, '失落沙洲', '又来到这个港口\r\n没有原因的拘留\r\n我的心乘着斑剥的轻舟\r\n寻找失落的沙洲\r\n随时间的海浪漂流\r\n我用力张开双手\r\n拥抱那么多起起落落\r\n想念的还是你望着我的眼波\r\n我不是一定要你回来\r\n只是当又一个人看海\r\n回头才发现你不在\r\n留下我迂回的徘徊\r\n我不是一定要你回来\r\n只是当又把回忆翻开\r\n除了你之外的空白\r\n还有谁能来教我爱\r\n又回到这个尽头我也想再往前走\r\n只是越看见海阔天空\r\n越遗憾没有你', '2015-12-18 1450435205.jpeg', '1450435205872', 1, 4),
(85, '缠绵游戏', '\r\n似听见这颗心滴血声\r\n回味着你昨晚像恶梦似的话\r\n你给我的竟不是爱情\r\n是你说从来无人\r\n像我在做尽傻事\r\n竟然仍然认真对这玩意\r\n为何从前爱得极度容易\r\n将来和谁再讲这段趣事\r\n缠绵游戏过后\r\n为何能舍得放手\r\n是定律或是爱不够\r\n告诉我这段缠绵游戏过后\r\n为何情不可永久\r\n是事实并没有真爱\r\n或跟本我未看透\r\n但觉得从前情人\r\n在世上并没存在\r\n多年来从未真正去被爱\r\n来来回回我只站在门外', '2015-12-18 1450435335.jpeg', '1450435335067', 1, 4),
(86, '伤', '我需要一个理由\r\n　　安抚破碎的信念\r\n　　脱下沉重的躯壳\r\n　　想隐藏一个谎言\r\n　　掩饰着卑微的脆弱\r\n　　不能再回到从前\r\n　　当所有的人失去\r\n　　原本该有的冲动\r\n　　怎么改变\r\n　　伤\r\n　　在背后\r\n　　抽刺着我不保留\r\n　　重拾所有的伤痛\r\n　　想要撑着我不会痛\r\n　　伤\r\n　　在胸口\r\n　　拉扯着我不保留\r\n　　冲破所有的嘲弄\r\n　　挣脱枷锁\r\n　　就让热血痛快汹涌\r\n　　我需要', '2015-12-18 1450435499.jpeg', '1450435499472', 1, 4),
(87, '忍不住想念', '分手那天 有些话忘了说\r\n应该是祝福   还有些什么\r\n我忘了那一刻算不算 哭太多\r\n你要的人生 没我\r\n\r\n反正你一定 要我好好过\r\n很快会发现 这都是收获\r\n我努力填满每分每秒 的生活\r\n却淹没不了 你的轮廓\r\n\r\n又忍不住去想念 你习惯说的字眼\r\n又忍不住再去 温习一遍\r\n过去所有照片  你笑得 多么甜\r\n\r\n又忍不住去想念 你承诺过的永远\r\n被对你的眷恋 惩罚一遍\r\n也许我 心甘情愿\r\n虽', '2015-12-18 1450435648.jpeg', '1450435667776', 1, 5),
(88, '走在红毯那一天', '算一算时间 认识他已好几年\r\n看一看身边 好朋友都有好姻缘\r\n只剩下我 只剩下你\r\n还继续苦守寒窑 一等十八年\r\n有些事急没有用 我了解\r\n我不想人老珠黄 才被人送作对\r\n走在红毯那一天 朦上白纱的脸\r\n微笑中流下的眼泪 一定很美\r\n走在红毯那一天 带上幸福的戒\r\n有个人厮守到永远 是一生所愿\r\n算一算时间 认识他已好几年\r\n看一看身边 好朋友都有好姻缘\r\n只剩下我 只剩下你\r\n还继续苦守寒窑 一', '2015-12-18 1450435759.jpeg', '1450435759914', 1, 5),
(89, '领悟', '我以为我会哭\r\n但是我没有\r\n我只是怔怔望着你的脚步\r\n给你我最后的祝福\r\n这何尝不是一种领悟\r\n让我把自己看清楚\r\n虽然那无爱的痛苦\r\n将日日夜夜\r\n在我灵魂最深处\r\n我以为我会报复\r\n但是我没有\r\n当我看到我深爱过的男人\r\n竟然像孩子一样无助\r\n这何尝不是一种领悟\r\n让你把自己看清楚\r\n被爱是奢侈的幸福\r\n可惜你从来不在乎\r\n啊!一段感情就此结束\r\n啊!一颗心眼看要荒芜\r\n我们的爱若是错误\r\n', '2015-12-18 1450435849.jpeg', '1450435849382', 1, 5),
(90, '像中枪一样（韩文）', '총맞은것처럼\r\n정신이 너무 없어\r\n\r\n웃음만 나와서\r\n그냥 웃었어 .. 그냥 웃었어\r\n그냥 ..\r\n\r\n허탈하게 웃으면\r\n하나만 묻자해서 ..\r\n\r\n우리 왜헤어져 ..\r\n어떻게 헤어져 ..\r\n어떻게 헤어져 .. 어떻게\r\n\r\n구멍난 가슴에 ..\r\n우리 추억이 흘러 넘쳐 ..\r\n\r\n잡아보려해도\r\n가슴을 막아도\r\n\r\n손가락 사이로 빠져나가\r\n심장이 멈춰도\r\n이렇게', '2015-12-18 1450435955.jpeg', '1450435955252', 1, 5),
(91, '无赖', '我间中饮醉酒\r\n很喜欢自由\r\n常犯错爱说谎\r\n但总会内疚\r\n遇过很多的损友\r\n学到贪新厌旧\r\n亦欠过很多女人\r\n\r\n怕结婚只会守\r\n三分钟诺言\r\n曾话过要戒烟\r\n但讲了就算\r\n梦与想丢低很远\r\n但对返工厌倦\r\n自小不会打算\r\n\r\n但是仍唯独你\r\n爱我这废人\r\n出错你都肯去忍\r\n然而谁亦早知\r\n不会合衬\r\n偏偏你愿意等\r\n\r\n为何还喜欢我\r\n我这种无赖\r\n是话你蠢\r\n还是很伟大\r\n在座每位都将我踩\r', '2015-12-18 1450436067.jpeg', '1450436067190', 1, 5);

-- --------------------------------------------------------

--
-- 表的结构 `bd_type`
--

CREATE TABLE IF NOT EXISTS `bd_type` (
  `id` tinyint(4) NOT NULL DEFAULT '0',
  `news_type_name` varchar(50) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `bd_type`
--

INSERT INTO `bd_type` (`id`, `news_type_name`) VALUES
(1, '推荐'),
(2, '百家'),
(3, '本地'),
(4, '娱乐'),
(5, '军事');

-- --------------------------------------------------------

--
-- 表的结构 `bd_user`
--

CREATE TABLE IF NOT EXISTS `bd_user` (
  `id` tinyint(4) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) NOT NULL DEFAULT '0',
  `password` varchar(50) NOT NULL DEFAULT '0',
  `status` varchar(2) NOT NULL DEFAULT '0',
  KEY `id` (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

--
-- 转存表中的数据 `bd_user`
--

INSERT INTO `bd_user` (`id`, `username`, `password`, `status`) VALUES
(1, '1', '1', '1'),
(2, 'jkxy', 'jkxy', '0'),
(3, 'lee', 'lee', '0');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
